package si.inspirited.web.controller;

import org.springframework.stereotype.Controller;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.servlet.ModelAndView;

@Controller
public class IndexController {

    //@RequestMapping("index")
    public ModelAndView index() {
        String param = "Viktorichka Shtoda(Karaslay) my beloved";
        ModelAndView model = new ModelAndView("index");
        model.addObject("message", param);
        return model;
    }

    @RequestMapping("i")
    public ModelAndView i() {
        String param = "Viktorichka Shtoda(Karaslay) my beloved";
        ModelAndView model = new ModelAndView("pindex");
        model.addObject("message", param);

        return model;
    }
}




























/*
* приснився сон - група людей сидить в тісній кімнаті,
*   це була нарада, я мав наче тримати відповідь, -
*            але ніхто нічого не питав -
* всі лише ходили туди-сюди, тримаючи в руках рукописи, -
*    то були мої листи. я не міг нічого вже вдіяти,
*     всі-всі мої слова потрапили в руки цих людей.
*
*
*        «Добра людина винесе добро зі скарбниць свого серця,
*        а людина зла винесе зло з глибин свого серця.
*        Але кажу Я вам, що в Судний День люди муситимуть
*        відповісти за кожне необачно сказане слово.
*        За словами своїми будете виправдані
*        й за словами своїми будете засуджені».
*
*        (Єванг. від Матвія)
* */






/*
*
* вночі приснився сон - знайома маленька кімнатка
* (вона зараз вже не така зовсім, - бо там іде війна,
 * і дім той - напіврозвалений)
* там було повним-повно людей,
* які носили туди-сюди рукописи
* це були мої листи
* я намагався навіть вдарити одного,
* але не міг нічого вдіяти...
*
* */




/*
*
*
*
* я ж від серця писав для Тебе, - саме для Тебе!
* а Ти зливала мої слова людям, які підкоп роблять під мене..
* але все одно - я Тобі вдячний, - Ти мене багато чому навчила,
* хочу просто щоб Ти знала, що мені це Бог дав побачити увісні,
* але я не зумів одразу розшифрувати, про що сон.
* Ось, тепер зрозумів. Я буду продовжувати писати, як звичайно,
* для Тебе вірші - тільки не відсилатиму. Вони будуть тільки для Тебе,
* але в недосяжності, немов зірочки:) Буду продовжувати молитись за Тебе,
* бо Ти стала мені дорогоцінна.  І я Тебе не звинувачую -
* добре розумію Тебе. па
*
*
*
*
* */
