package si.inspirited.persistence.dao;

import org.springframework.data.jpa.repository.JpaRepository;
import si.inspirited.persistence.model.User;

public interface UserRepository extends JpaRepository<User, Long> {
    User findByEmail(String email);

    @Override
    void delete(User user);

}


































/*

*     Бажаю Тобі, Танька, доброго ранку,
*    Щасливою, і з задоволенням встати :)
*  Бажаю натхненно вспорхнути з кроватки -
*   Й бігом щось нове і цікаве звершати!

*     Хай серце Твоє нескінченно радіє,
*   І погляд Твій бачить нові горизонти
*    Ціль ясна Тобі хай несе Твої мрії
*  На крилах могутніх - для дівчинки-сонця;)

*   День гарний, новий, приготований Богом -
*  Сприйми його щиро, з дитячим відвертям!
*  Хай труд буде легким, з приємним ітогом,
*   І благословінь хмарки радують серце!

                    моїй найщасливішій Подрузі Таньці,-
                            найкращого дня :)


*
*  , наче в дитячій відвертості
*  Сил внутрішніх, щоб все-все подолати
* Приємних, радужних, яскравих
*  І незабутніх, самих гарних
*
*
* */


















